In [1]:
import pandas as pd
import numpy as np

In [7]:
import os
print(os.getcwd())

/Users/prasadmakkirolla

In [10]:
df = pd.read_csv("titanic/train.csv")

In [11]:
import os
print(os.listdir("titanic"))

['test.csv', 'train.csv', 'gender_submission.csv']

In [12]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [14]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [15]:
df['Embarked'].value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [16]:
df['Embarked']=df['Embarked'].fillna('S')

In [17]:
df['Age'] = df.groupby('Pclass')['Age'].transform(lambda x: x.fillna(x.mean()))

In [18]:
df.drop(columns='Cabin', inplace=True)

In [19]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [20]:
df.groupby(['Pclass', 'Sex'])[['Age', 'Fare']].mean().sort_values('Fare', ascending=False)

                     Age        Fare
Pclass Sex
1      female  34.958521  106.125798
       male    40.756740   67.226127
2      female  28.753359   21.970121
       male    30.668784   19.741782
3      female  22.738931   16.118810
       male    26.137286   12.661633

In [21]:
df.groupby('Pclass').agg({
    'Age': ['mean', 'median'],
    'Fare': ['mean', 'max', 'min'],
    'Survived': 'mean'
})

              Age                  Fare                 Survived
             mean     median       mean       max  min      mean
Pclass
1       38.233441  38.233441  84.154687  512.3292  0.0  0.629630
2       29.877630  29.877630  20.662183   73.5000  0.0  0.472826
3       25.140620  25.140620  13.675550   69.5500  0.0  0.242363

In [22]:
df['IsAlone'] = df.apply(lambda row: 1 if (row['SibSp'] + row['Parch']) == 0 else 0, axis=1)

In [23]:
df['IsAlone'].value_counts()

IsAlone
1    537
0    354
Name: count, dtype: int64

In [24]:
def age_category(age):
    if age < 13:
        return 'Child'
    elif age < 60:
        return 'Adult'
    else:
        return 'Senior'

df['AgeGroup'] = df['Age'].apply(age_category)

In [25]:
df[['Age', 'IsAlone', 'AgeGroup']].head()

    Age  IsAlone AgeGroup
0  22.0        0    Adult
1  38.0        0    Adult
2  26.0        1    Adult
3  35.0        0    Adult
4  35.0        1    Adult

In [27]:
df.to_csv('titanic_cleaned_day1.csv', index=False)